``` Terraform will perform the following actions:

  # aws_route53_record.usegalaxy_eu_forwardmail_validation_txt will be updated in-place
  ~ resource "aws_route53_record" "usegalaxy_eu_forwardmail_validation_txt" {
        id              = "Z1C7L7XFF9613J__TXT"
      ~ ttl             = 10 -> 3600
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.celery[0] will be destroyed
  # (because openstack_compute_instance_v2.celery is not in configuration)
  - resource "openstack_compute_instance_v2" "celery" {
      - access_ip_v4        = "10.5.67.216" -> null
      - all_metadata        = {} -> null
      - all_tags            = [] -> null
      - availability_zone   = "nova" -> null
      - flavor_id           = "7e0d5c26-8e57-42ac-83fe-765fe2621fd7" -> null
      - flavor_name         = "m1.xxlarge" -> null
      - force_delete        = false -> null
      - id                  = "9643565e-cc0d-4e31-b709-7af4aea91c2e" -> null
      - image_id            = "40226406-34a7-48a8-8daf-b674cdec93b6" -> null
      - image_name          = "generic-rockylinux8-v60-j168-5333625af7b2-main" -> null
      - key_pair            = "cloud2" -> null
      - name                = "celery-0.galaxyproject.eu" -> null
      - power_state         = "shutoff" -> null
      - region              = "Freiburg" -> null
      - security_groups     = [
          - "default",
          - "ingress-from-proxy",
        ] -> null
      - stop_before_destroy = false -> null
      - tags                = [] -> null
      - user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc" -> null

      - network {
          - access_network = false -> null
          - fixed_ip_v4    = "10.5.67.216" -> null
          - mac            = "fa:16:3e:3e:8c:9a" -> null
          - name           = "bioinf" -> null
          - uuid           = "378eedcc-cc61-4564-96de-5c78be5a52e3" -> null
        }
    }

  # openstack_networking_secgroup_rule_v2.interactive-egress-internal-network will be created
  + resource "openstack_networking_secgroup_rule_v2" "interactive-egress-internal-network" {
      + direction         = "egress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = (known after apply)
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "10.0.0.0/8"
      + security_group_id = "2df98248-0b6a-4763-90a8-e77a859d2457"
      + tenant_id         = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```